# BuiltInFailures.RebarSystemFailures Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures Class
BuiltInFailures Class Members See Also
---
Failures related to rebar systems.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class RebarSystemFailures
```

Visual Basic
---
```text
Public NotInheritable Class RebarSystemFailures
```

Visual C++
---
```text
public ref class RebarSystemFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..RebarSystemFailures
# See Also
BuiltInFailures..::..RebarSystemFailures Members
Autodesk.Revit.DB Namespace